benjami-r/f000/Core/Inc/My_stm32f072xb.h
// My rem:
//Т.к. подключаем в asm-файл, то отключаем все typedef (string 70...).
//и отключаем (пока что?) все include (string 120...).

/**
  ******************************************************************************
  * @file    My_stm32f072xb.h
  * @author  MCD Application Team
  * @brief   CMSIS Cortex-M0 Device Peripheral Access Layer Header File.
  *          This file contains all the peripheral register's definitions, bits
  *          definitions and memory mapping for STM32F0xx devices.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup stm32f072xb
  * @{
  */

#ifndef __My_STM32F072xB_H
#define __My_STM32F072xB_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */
/**
 * @brief Configuration of the Cortex-M0 Processor and Core Peripherals
 */
#define __CM0_REV                 0 /*!< Core Revision r0p0                            */
#define __MPU_PRESENT             0 /*!< STM32F0xx do not provide MPU                  */
#define __NVIC_PRIO_BITS          2 /*!< STM32F0xx uses 2 Bits for the Priority Levels */
#define __Vendor_SysTickConfig    0     /*!< Set to 1 if different SysTick Config is used */

/**
  * @}
  */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

/**
 * @brief STM32F0xx Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */

/*!< Interrupt Number Definition */
// My rem:
// typedef enum
// {
// /******  Cortex-M0 Processor Exceptions Numbers **************************************************************/
//   NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                                        */
//   HardFault_IRQn              = -13,    /*!< 3 Cortex-M0 Hard Fault Interrupt                                */
//   SVCall_IRQn                 = -5,     /*!< 11 Cortex-M0 SV Call Interrupt                                  */
//   PendSV_IRQn                 = -2,     /*!< 14 Cortex-M0 Pend SV Interrupt                                  */
//   SysTick_IRQn                = -1,     /*!< 15 Cortex-M0 System Tick Interrupt                              */

// /******  STM32F0 specific Interrupt Numbers ******************************************************************/
//   WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                               */
//   PVD_VDDIO2_IRQn             = 1,      /*!< PVD & VDDIO2 Interrupt through EXTI Lines 16 and 31             */
//   RTC_IRQn                    = 2,      /*!< RTC Interrupt through EXTI Lines 17, 19 and 20                  */
//   FLASH_IRQn                  = 3,      /*!< FLASH global Interrupt                                          */
//   RCC_CRS_IRQn                = 4,      /*!< RCC & CRS global Interrupt                                      */
//   EXTI0_1_IRQn                = 5,      /*!< EXTI Line 0 and 1 Interrupt                                     */
//   EXTI2_3_IRQn                = 6,      /*!< EXTI Line 2 and 3 Interrupt                                     */
//   EXTI4_15_IRQn               = 7,      /*!< EXTI Line 4 to 15 Interrupt                                     */
//   TSC_IRQn                    = 8,      /*!< Touch Sensing Controller Interrupts                             */
//   DMA1_Channel1_IRQn          = 9,      /*!< DMA1 Channel 1 Interrupt                                        */
//   DMA1_Channel2_3_IRQn        = 10,     /*!< DMA1 Channel 2 and Channel 3 Interrupt                          */
//   DMA1_Channel4_5_6_7_IRQn    = 11,     /*!< DMA1 Channel 4 to Channel 7 Interrupt                           */
//   ADC1_COMP_IRQn              = 12,     /*!< ADC1 and COMP interrupts (ADC interrupt combined with EXTI Lines 21 and 22 */
//   TIM1_BRK_UP_TRG_COM_IRQn    = 13,     /*!< TIM1 Break, Update, Trigger and Commutation Interrupt           */
//   TIM1_CC_IRQn                = 14,     /*!< TIM1 Capture Compare Interrupt                                  */
//   TIM2_IRQn                   = 15,     /*!< TIM2 global Interrupt                                           */
//   TIM3_IRQn                   = 16,     /*!< TIM3 global Interrupt                                           */
//   TIM6_DAC_IRQn               = 17,     /*!< TIM6 global and DAC channel underrun error Interrupt            */
//   TIM7_IRQn                   = 18,     /*!< TIM7 global Interrupt                                           */
//   TIM14_IRQn                  = 19,     /*!< TIM14 global Interrupt                                          */
//   TIM15_IRQn                  = 20,     /*!< TIM15 global Interrupt                                          */
//   TIM16_IRQn                  = 21,     /*!< TIM16 global Interrupt                                          */
//   TIM17_IRQn                  = 22,     /*!< TIM17 global Interrupt                                          */
//   I2C1_IRQn                   = 23,     /*!< I2C1 Event Interrupt & EXTI Line23 Interrupt (I2C1 wakeup)      */
//   I2C2_IRQn                   = 24,     /*!< I2C2 Event Interrupt                                            */
//   SPI1_IRQn                   = 25,     /*!< SPI1 global Interrupt                                           */
//   SPI2_IRQn                   = 26,     /*!< SPI2 global Interrupt                                           */
//   USART1_IRQn                 = 27,     /*!< USART1 global Interrupt & EXTI Line25 Interrupt (USART1 wakeup) */
//   USART2_IRQn                 = 28,     /*!< USART2 global Interrupt & EXTI Line26 Interrupt (USART2 wakeup) */
//   USART3_4_IRQn               = 29,     /*!< USART3 and USART4 global Interrupt                              */
//   CEC_CAN_IRQn                = 30,     /*!< CEC and CAN global Interrupts & EXTI Line27 Interrupt           */
//   USB_IRQn                    = 31      /*!< USB global Interrupt  & EXTI Line18 Interrupt                   */
// } IRQn_Type;

