benjami-r/f000/Core/Inc/My_stm32f072xb.h
// /**
//   * @}
//   */

// // My rem:
// //#include "core_cm0.h"            /* Cortex-M0 processor and core peripherals */
// //#include "system_stm32f0xx.h"    /* STM32F0xx System Header */
// //#include <stdint.h>

// /** @addtogroup Peripheral_registers_structures
//   * @{
//   */

// /**
//   * @brief Analog to Digital Converter
//   */

// typedef struct
// {
//   __IO uint32_t ISR;          /*!< ADC interrupt and status register,             Address offset: 0x00 */
//   __IO uint32_t IER;          /*!< ADC interrupt enable register,                 Address offset: 0x04 */
//   __IO uint32_t CR;           /*!< ADC control register,                          Address offset: 0x08 */
//   __IO uint32_t CFGR1;        /*!< ADC configuration register 1,                  Address offset: 0x0C */
//   __IO uint32_t CFGR2;        /*!< ADC configuration register 2,                  Address offset: 0x10 */
//   __IO uint32_t SMPR;         /*!< ADC sampling time register,                    Address offset: 0x14 */
//        uint32_t RESERVED1;    /*!< Reserved,                                                      0x18 */
//        uint32_t RESERVED2;    /*!< Reserved,                                                      0x1C */
//   __IO uint32_t TR;           /*!< ADC analog watchdog 1 threshold register,      Address offset: 0x20 */
//        uint32_t RESERVED3;    /*!< Reserved,                                                      0x24 */
//   __IO uint32_t CHSELR;       /*!< ADC group regular sequencer register,          Address offset: 0x28 */
//        uint32_t RESERVED4[5]; /*!< Reserved,                                                      0x2C */
//   __IO uint32_t DR;           /*!< ADC group regular data register,               Address offset: 0x40 */
// } ADC_TypeDef;

// typedef struct
// {
//   __IO uint32_t CCR;          /*!< ADC common configuration register,             Address offset: ADC1 base address + 0x308 */
// } ADC_Common_TypeDef;

// /**
//   * @brief Controller Area Network TxMailBox
//   */
// typedef struct
// {
//   __IO uint32_t TIR;  /*!< CAN TX mailbox identifier register */
//   __IO uint32_t TDTR; /*!< CAN mailbox data length control and time stamp register */
//   __IO uint32_t TDLR; /*!< CAN mailbox data low register */
//   __IO uint32_t TDHR; /*!< CAN mailbox data high register */
// }CAN_TxMailBox_TypeDef;

// /**
//   * @brief Controller Area Network FIFOMailBox
//   */
// typedef struct
// {
//   __IO uint32_t RIR;  /*!< CAN receive FIFO mailbox identifier register */
//   __IO uint32_t RDTR; /*!< CAN receive FIFO mailbox data length control and time stamp register */
//   __IO uint32_t RDLR; /*!< CAN receive FIFO mailbox data low register */
//   __IO uint32_t RDHR; /*!< CAN receive FIFO mailbox data high register */
// }CAN_FIFOMailBox_TypeDef;

// /**
//   * @brief Controller Area Network FilterRegister
//   */
// typedef struct
// {
//   __IO uint32_t FR1; /*!< CAN Filter bank register 1 */
//   __IO uint32_t FR2; /*!< CAN Filter bank register 1 */
// }CAN_FilterRegister_TypeDef;

// /**
//   * @brief Controller Area Network
//   */
// typedef struct
// {
//   __IO uint32_t              MCR;                 /*!< CAN master control register,         Address offset: 0x00          */
//   __IO uint32_t              MSR;                 /*!< CAN master status register,          Address offset: 0x04          */
//   __IO uint32_t              TSR;                 /*!< CAN transmit status register,        Address offset: 0x08          */
//   __IO uint32_t              RF0R;                /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
//   __IO uint32_t              RF1R;                /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
//   __IO uint32_t              IER;                 /*!< CAN interrupt enable register,       Address offset: 0x14          */
//   __IO uint32_t              ESR;                 /*!< CAN error status register,           Address offset: 0x18          */
//   __IO uint32_t              BTR;                 /*!< CAN bit timing register,             Address offset: 0x1C          */
//   uint32_t                   RESERVED0[88];       /*!< Reserved, 0x020 - 0x17F                                            */
//   CAN_TxMailBox_TypeDef      sTxMailBox[3];       /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
//   CAN_FIFOMailBox_TypeDef    sFIFOMailBox[2];     /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
//   uint32_t                   RESERVED1[12];       /*!< Reserved, 0x1D0 - 0x1FF                                            */
//   __IO uint32_t              FMR;                 /*!< CAN filter master register,          Address offset: 0x200         */
//   __IO uint32_t              FM1R;                /*!< CAN filter mode register,            Address offset: 0x204         */
//   uint32_t                   RESERVED2;           /*!< Reserved, 0x208                                                    */
//   __IO uint32_t              FS1R;                /*!< CAN filter scale register,           Address offset: 0x20C         */
//   uint32_t                   RESERVED3;           /*!< Reserved, 0x210                                                    */
//   __IO uint32_t              FFA1R;               /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
//   uint32_t                   RESERVED4;           /*!< Reserved, 0x218                                                    */
//   __IO uint32_t              FA1R;                /*!< CAN filter activation register,      Address offset: 0x21C         */
//   uint32_t                   RESERVED5[8];        /*!< Reserved, 0x220-0x23F                                              */
//   CAN_FilterRegister_TypeDef sFilterRegister[14]; /*!< CAN Filter Register,                 Address offset: 0x240-0x2AC   */
// }CAN_TypeDef;

