benjami-r/f000/Core/Inc/My_stm32f072xb.h
// /**
//   * @brief HDMI-CEC
//   */

// typedef struct
// {
//   __IO uint32_t CR;           /*!< CEC control register,                                       Address offset:0x00 */
//   __IO uint32_t CFGR;         /*!< CEC configuration register,                                 Address offset:0x04 */
//   __IO uint32_t TXDR;         /*!< CEC Tx data register ,                                      Address offset:0x08 */
//   __IO uint32_t RXDR;         /*!< CEC Rx Data Register,                                       Address offset:0x0C */
//   __IO uint32_t ISR;          /*!< CEC Interrupt and Status Register,                          Address offset:0x10 */
//   __IO uint32_t IER;          /*!< CEC interrupt enable register,                              Address offset:0x14 */
// }CEC_TypeDef;

// /**
//   * @brief Comparator
//   */

// typedef struct
// {
//   __IO uint16_t CSR;         /*!< COMP control and status register,                                                 Address offset: 0x00 */
// } COMP_TypeDef;

// typedef struct
// {
//   __IO uint32_t CSR;         /*!< COMP control and status register, used for bits common to several COMP instances, Address offset: 0x00 */
// } COMP_Common_TypeDef;

// /* Legacy defines */
// typedef struct
// {
//   __IO uint32_t CSR;         /*!< Kept for legacy purpose. Use structure 'COMP_Common_TypeDef'. */
// }COMP1_2_TypeDef;

// /**
//   * @brief CRC calculation unit
//   */

// typedef struct
// {
//   __IO uint32_t DR;          /*!< CRC Data register,                           Address offset: 0x00 */
//   __IO uint8_t  IDR;         /*!< CRC Independent data register,               Address offset: 0x04 */
//   uint8_t       RESERVED0;   /*!< Reserved,                                                    0x05 */
//   uint16_t      RESERVED1;   /*!< Reserved,                                                    0x06 */
//   __IO uint32_t CR;          /*!< CRC Control register,                        Address offset: 0x08 */
//   uint32_t      RESERVED2;   /*!< Reserved,                                                    0x0C */
//   __IO uint32_t INIT;        /*!< Initial CRC value register,                  Address offset: 0x10 */
//   __IO uint32_t POL;         /*!< CRC polynomial register,                     Address offset: 0x14 */
// } CRC_TypeDef;

// /**
//   * @brief Clock Recovery System
//   */
// typedef struct
// {
// __IO uint32_t CR;     /*!< CRS ccontrol register,              Address offset: 0x00 */
// __IO uint32_t CFGR;   /*!< CRS configuration register,         Address offset: 0x04 */
// __IO uint32_t ISR;    /*!< CRS interrupt and status register,  Address offset: 0x08 */
// __IO uint32_t ICR;    /*!< CRS interrupt flag clear register,  Address offset: 0x0C */
// }CRS_TypeDef;

// /**
//   * @brief Digital to Analog Converter
//   */

// typedef struct
// {
//   __IO uint32_t CR;           /*!< DAC control register,                                     Address offset: 0x00 */
//   __IO uint32_t SWTRIGR;      /*!< DAC software trigger register,                            Address offset: 0x04 */
//   __IO uint32_t DHR12R1;      /*!< DAC channel1 12-bit right-aligned data holding register,  Address offset: 0x08 */
//   __IO uint32_t DHR12L1;      /*!< DAC channel1 12-bit left aligned data holding register,   Address offset: 0x0C */
//   __IO uint32_t DHR8R1;       /*!< DAC channel1 8-bit right aligned data holding register,   Address offset: 0x10 */
//   __IO uint32_t DHR12R2;      /*!< DAC channel2 12-bit right aligned data holding register,  Address offset: 0x14 */
//   __IO uint32_t DHR12L2;      /*!< DAC channel2 12-bit left aligned data holding register,   Address offset: 0x18 */
//   __IO uint32_t DHR8R2;       /*!< DAC channel2 8-bit right-aligned data holding register,   Address offset: 0x1C */
//   __IO uint32_t DHR12RD;      /*!< Dual DAC 12-bit right-aligned data holding register,      Address offset: 0x20 */
//   __IO uint32_t DHR12LD;      /*!< DUAL DAC 12-bit left aligned data holding register,       Address offset: 0x24 */
//   __IO uint32_t DHR8RD;       /*!< DUAL DAC 8-bit right aligned data holding register,       Address offset: 0x28 */
//   __IO uint32_t DOR1;         /*!< DAC channel1 data output register,                        Address offset: 0x2C */
//   __IO uint32_t DOR2;         /*!< DAC channel2 data output register,                        Address offset: 0x30 */
//   __IO uint32_t SR;           /*!< DAC status register,                                      Address offset: 0x34 */
// } DAC_TypeDef;

// /**
//   * @brief Debug MCU
//   */

// typedef struct
// {
//   __IO uint32_t IDCODE;       /*!< MCU device ID code,                          Address offset: 0x00 */
//   __IO uint32_t CR;           /*!< Debug MCU configuration register,            Address offset: 0x04 */
//   __IO uint32_t APB1FZ;       /*!< Debug MCU APB1 freeze register,              Address offset: 0x08 */
//   __IO uint32_t APB2FZ;       /*!< Debug MCU APB2 freeze register,              Address offset: 0x0C */
// }DBGMCU_TypeDef;

// /**
//   * @brief DMA Controller
//   */

// typedef struct
// {
//   __IO uint32_t CCR;          /*!< DMA channel x configuration register        */
//   __IO uint32_t CNDTR;        /*!< DMA channel x number of data register       */
//   __IO uint32_t CPAR;         /*!< DMA channel x peripheral address register   */
//   __IO uint32_t CMAR;         /*!< DMA channel x memory address register       */
// } DMA_Channel_TypeDef;

// typedef struct
// {
//   __IO uint32_t ISR;          /*!< DMA interrupt status register,               Address offset: 0x00 */
//   __IO uint32_t IFCR;         /*!< DMA interrupt flag clear register,           Address offset: 0x04 */
// } DMA_TypeDef;

// /**
//   * @brief External Interrupt/Event Controller
//   */

// typedef struct
// {
//   __IO uint32_t IMR;          /*!<EXTI Interrupt mask register,                 Address offset: 0x00 */
//   __IO uint32_t EMR;          /*!<EXTI Event mask register,                     Address offset: 0x04 */
//   __IO uint32_t RTSR;         /*!<EXTI Rising trigger selection register ,      Address offset: 0x08 */
//   __IO uint32_t FTSR;         /*!<EXTI Falling trigger selection register,      Address offset: 0x0C */
//   __IO uint32_t SWIER;        /*!<EXTI Software interrupt event register,       Address offset: 0x10 */
//   __IO uint32_t PR;           /*!<EXTI Pending register,                        Address offset: 0x14 */
// } EXTI_TypeDef;

