benjami-r/f000/Core/Inc/My_stm32f072xb.h
// /**
//   * @brief FLASH Registers
//   */
// typedef struct
// {
//   __IO uint32_t ACR;          /*!<FLASH access control register,                 Address offset: 0x00 */
//   __IO uint32_t KEYR;         /*!<FLASH key register,                            Address offset: 0x04 */
//   __IO uint32_t OPTKEYR;      /*!<FLASH OPT key register,                        Address offset: 0x08 */
//   __IO uint32_t SR;           /*!<FLASH status register,                         Address offset: 0x0C */
//   __IO uint32_t CR;           /*!<FLASH control register,                        Address offset: 0x10 */
//   __IO uint32_t AR;           /*!<FLASH address register,                        Address offset: 0x14 */
//   __IO uint32_t RESERVED;     /*!< Reserved,                                                     0x18 */
//   __IO uint32_t OBR;          /*!<FLASH option bytes register,                   Address offset: 0x1C */
//   __IO uint32_t WRPR;         /*!<FLASH option bytes register,                   Address offset: 0x20 */
// } FLASH_TypeDef;

// /**
//   * @brief Option Bytes Registers
//   */
// typedef struct
// {
//   __IO uint16_t RDP;          /*!< FLASH option byte Read protection,             Address offset: 0x00 */
//   __IO uint16_t USER;         /*!< FLASH option byte user options,                Address offset: 0x02 */
//   __IO uint16_t DATA0;        /*!< User data byte 0 (stored in FLASH_OBR[23:16]), Address offset: 0x04 */
//   __IO uint16_t DATA1;        /*!< User data byte 1 (stored in FLASH_OBR[31:24]), Address offset: 0x06 */
//   __IO uint16_t WRP0;         /*!< FLASH option byte write protection 0,          Address offset: 0x08 */
//   __IO uint16_t WRP1;         /*!< FLASH option byte write protection 1,          Address offset: 0x0A */
//   __IO uint16_t WRP2;         /*!< FLASH option byte write protection 2,          Address offset: 0x0C */
//   __IO uint16_t WRP3;         /*!< FLASH option byte write protection 3,          Address offset: 0x0E */
// } OB_TypeDef;

// /**
//   * @brief General Purpose I/O
//   */

// typedef struct
// {
//   __IO uint32_t MODER;        /*!< GPIO port mode register,                     Address offset: 0x00      */
//   __IO uint32_t OTYPER;       /*!< GPIO port output type register,              Address offset: 0x04      */
//   __IO uint32_t OSPEEDR;      /*!< GPIO port output speed register,             Address offset: 0x08      */
//   __IO uint32_t PUPDR;        /*!< GPIO port pull-up/pull-down register,        Address offset: 0x0C      */
//   __IO uint32_t IDR;          /*!< GPIO port input data register,               Address offset: 0x10      */
//   __IO uint32_t ODR;          /*!< GPIO port output data register,              Address offset: 0x14      */
//   __IO uint32_t BSRR;         /*!< GPIO port bit set/reset register,      Address offset: 0x1A */
//   __IO uint32_t LCKR;         /*!< GPIO port configuration lock register,       Address offset: 0x1C      */
//   __IO uint32_t AFR[2];       /*!< GPIO alternate function low register,  Address offset: 0x20-0x24 */
//   __IO uint32_t BRR;          /*!< GPIO bit reset register,                     Address offset: 0x28      */
// } GPIO_TypeDef;

// /**
//   * @brief SysTem Configuration
//   */

// typedef struct
// {
//   __IO uint32_t CFGR1;       /*!< SYSCFG configuration register 1,                           Address offset: 0x00 */
//        uint32_t RESERVED;    /*!< Reserved,                                                                  0x04 */
//   __IO uint32_t EXTICR[4];   /*!< SYSCFG external interrupt configuration register,     Address offset: 0x14-0x08 */
//   __IO uint32_t CFGR2;       /*!< SYSCFG configuration register 2,                           Address offset: 0x18 */
// } SYSCFG_TypeDef;

// /**
//   * @brief Inter-integrated Circuit Interface
//   */

// typedef struct
// {
//   __IO uint32_t CR1;          /*!< I2C Control register 1,                      Address offset: 0x00 */
//   __IO uint32_t CR2;          /*!< I2C Control register 2,                      Address offset: 0x04 */
//   __IO uint32_t OAR1;     /*!< I2C Own address 1 register,        Address offset: 0x08 */
//   __IO uint32_t OAR2;     /*!< I2C Own address 2 register,        Address offset: 0x0C */
//   __IO uint32_t TIMINGR;  /*!< I2C Timing register,               Address offset: 0x10 */
//   __IO uint32_t TIMEOUTR; /*!< I2C Timeout register,              Address offset: 0x14 */
//   __IO uint32_t ISR;      /*!< I2C Interrupt and status register, Address offset: 0x18 */
//   __IO uint32_t ICR;      /*!< I2C Interrupt clear register,      Address offset: 0x1C */
//   __IO uint32_t PECR;     /*!< I2C PEC register,                  Address offset: 0x20 */
//   __IO uint32_t RXDR;     /*!< I2C Receive data register,         Address offset: 0x24 */
//   __IO uint32_t TXDR;     /*!< I2C Transmit data register,        Address offset: 0x28 */
// } I2C_TypeDef;

// /**
//   * @brief Independent WATCHDOG
//   */

// typedef struct
// {
//   __IO uint32_t KR;   /*!< IWDG Key register,       Address offset: 0x00 */
//   __IO uint32_t PR;   /*!< IWDG Prescaler register, Address offset: 0x04 */
//   __IO uint32_t RLR;  /*!< IWDG Reload register,    Address offset: 0x08 */
//   __IO uint32_t SR;   /*!< IWDG Status register,    Address offset: 0x0C */
//   __IO uint32_t WINR; /*!< IWDG Window register,    Address offset: 0x10 */
// } IWDG_TypeDef;

// /**
//   * @brief Power Control
//   */

// typedef struct
// {
//   __IO uint32_t CR;   /*!< PWR power control register,                          Address offset: 0x00 */
//   __IO uint32_t CSR;  /*!< PWR power control/status register,                   Address offset: 0x04 */
// } PWR_TypeDef;

// /**
//   * @brief Reset and Clock Control
//   */

// typedef struct
// {
//   __IO uint32_t CR;            /*!< RCC clock control register,                                   Address offset: 0x00 */
//   __IO uint32_t CFGR;       /*!< RCC clock configuration register,                            Address offset: 0x04 */
//   __IO uint32_t CIR;        /*!< RCC clock interrupt register,                                Address offset: 0x08 */
//   __IO uint32_t APB2RSTR;   /*!< RCC APB2 peripheral reset register,                          Address offset: 0x0C */
//   __IO uint32_t APB1RSTR;   /*!< RCC APB1 peripheral reset register,                          Address offset: 0x10 */
//   __IO uint32_t AHBENR;     /*!< RCC AHB peripheral clock register,                           Address offset: 0x14 */
//   __IO uint32_t APB2ENR;    /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x18 */
//   __IO uint32_t APB1ENR;    /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x1C */
//   __IO uint32_t BDCR;       /*!< RCC Backup domain control register,                          Address offset: 0x20 */
//   __IO uint32_t CSR;        /*!< RCC clock control & status register,                         Address offset: 0x24 */
//   __IO uint32_t AHBRSTR;    /*!< RCC AHB peripheral reset register,                           Address offset: 0x28 */
//   __IO uint32_t CFGR2;      /*!< RCC clock configuration register 2,                          Address offset: 0x2C */
//   __IO uint32_t CFGR3;      /*!< RCC clock configuration register 3,                          Address offset: 0x30 */
//   __IO uint32_t CR2;        /*!< RCC clock control register 2,                                Address offset: 0x34 */
// } RCC_TypeDef;

