benjami-r/f000/Core/Inc/My_stm32f072xb.h
// /**
//   * @brief Real-Time Clock
//   */
// typedef struct
// {
//   __IO uint32_t TR;         /*!< RTC time register,                                         Address offset: 0x00 */
//   __IO uint32_t DR;         /*!< RTC date register,                                         Address offset: 0x04 */
//   __IO uint32_t CR;         /*!< RTC control register,                                      Address offset: 0x08 */
//   __IO uint32_t ISR;        /*!< RTC initialization and status register,                    Address offset: 0x0C */
//   __IO uint32_t PRER;       /*!< RTC prescaler register,                                    Address offset: 0x10 */
//   __IO uint32_t WUTR;       /*!< RTC wakeup timer register,                                 Address offset: 0x14 */
//        uint32_t RESERVED1;  /*!< Reserved,                                                  Address offset: 0x18 */
//   __IO uint32_t ALRMAR;     /*!< RTC alarm A register,                                      Address offset: 0x1C */
//        uint32_t RESERVED2;  /*!< Reserved,                                                  Address offset: 0x20 */
//   __IO uint32_t WPR;        /*!< RTC write protection register,                             Address offset: 0x24 */
//   __IO uint32_t SSR;        /*!< RTC sub second register,                                   Address offset: 0x28 */
//   __IO uint32_t SHIFTR;     /*!< RTC shift control register,                                Address offset: 0x2C */
//   __IO uint32_t TSTR;       /*!< RTC time stamp time register,                              Address offset: 0x30 */
//   __IO uint32_t TSDR;       /*!< RTC time stamp date register,                              Address offset: 0x34 */
//   __IO uint32_t TSSSR;      /*!< RTC time-stamp sub second register,                        Address offset: 0x38 */
//   __IO uint32_t CALR;       /*!< RTC calibration register,                                  Address offset: 0x3C */
//   __IO uint32_t TAFCR;      /*!< RTC tamper and alternate function configuration register,  Address offset: 0x40 */
//   __IO uint32_t ALRMASSR;   /*!< RTC alarm A sub second register,                           Address offset: 0x44 */
//        uint32_t RESERVED3;  /*!< Reserved,                                                  Address offset: 0x48 */
//        uint32_t RESERVED4;  /*!< Reserved,                                                  Address offset: 0x4C */
//   __IO uint32_t BKP0R;      /*!< RTC backup register 0,                                     Address offset: 0x50 */
//   __IO uint32_t BKP1R;      /*!< RTC backup register 1,                                     Address offset: 0x54 */
//   __IO uint32_t BKP2R;      /*!< RTC backup register 2,                                     Address offset: 0x58 */
//   __IO uint32_t BKP3R;      /*!< RTC backup register 3,                                     Address offset: 0x5C */
//   __IO uint32_t BKP4R;      /*!< RTC backup register 4,                                     Address offset: 0x60 */
// } RTC_TypeDef;

// /**
//   * @brief Serial Peripheral Interface
//   */

// typedef struct
// {
//   __IO uint32_t CR1;        /*!< SPI Control register 1 (not used in I2S mode),      Address offset: 0x00 */
//   __IO uint32_t CR2;        /*!< SPI Control register 2,                             Address offset: 0x04 */
//   __IO uint32_t SR;         /*!< SPI Status register,                                Address offset: 0x08 */
//   __IO uint32_t DR;         /*!< SPI data register,                                  Address offset: 0x0C */
//   __IO uint32_t CRCPR;      /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
//   __IO uint32_t RXCRCR;     /*!< SPI Rx CRC register (not used in I2S mode),         Address offset: 0x14 */
//   __IO uint32_t TXCRCR;     /*!< SPI Tx CRC register (not used in I2S mode),         Address offset: 0x18 */
//   __IO uint32_t I2SCFGR;    /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
//   __IO uint32_t I2SPR;      /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
// } SPI_TypeDef;

// /**
//   * @brief TIM
//   */
// typedef struct
// {
//   __IO uint32_t CR1;          /*!< TIM control register 1,              Address offset: 0x00 */
//   __IO uint32_t CR2;          /*!< TIM control register 2,              Address offset: 0x04 */
//   __IO uint32_t SMCR;         /*!< TIM slave Mode Control register,     Address offset: 0x08 */
//   __IO uint32_t DIER;         /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
//   __IO uint32_t SR;           /*!< TIM status register,                 Address offset: 0x10 */
//   __IO uint32_t EGR;          /*!< TIM event generation register,       Address offset: 0x14 */
//   __IO uint32_t CCMR1;        /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
//   __IO uint32_t CCMR2;        /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
//   __IO uint32_t CCER;         /*!< TIM capture/compare enable register, Address offset: 0x20 */
//   __IO uint32_t CNT;          /*!< TIM counter register,                Address offset: 0x24 */
//   __IO uint32_t PSC;          /*!< TIM prescaler register,              Address offset: 0x28 */
//   __IO uint32_t ARR;          /*!< TIM auto-reload register,            Address offset: 0x2C */
//   __IO uint32_t RCR;             /*!< TIM  repetition counter register,            Address offset: 0x30 */
//   __IO uint32_t CCR1;         /*!< TIM capture/compare register 1,      Address offset: 0x34 */
//   __IO uint32_t CCR2;         /*!< TIM capture/compare register 2,      Address offset: 0x38 */
//   __IO uint32_t CCR3;         /*!< TIM capture/compare register 3,      Address offset: 0x3C */
//   __IO uint32_t CCR4;         /*!< TIM capture/compare register 4,      Address offset: 0x40 */
//   __IO uint32_t BDTR;            /*!< TIM break and dead-time register,            Address offset: 0x44 */
//   __IO uint32_t DCR;          /*!< TIM DMA control register,            Address offset: 0x48 */
//   __IO uint32_t DMAR;            /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
//   __IO uint32_t OR;           /*!< TIM option register,                 Address offset: 0x50 */
// } TIM_TypeDef;

