benjami-r/f000/Core/Inc/My_stm32f072xb.h
// /**
//   * @brief Touch Sensing Controller (TSC)
//   */
// typedef struct
// {
//   __IO uint32_t CR;        /*!< TSC control register,                                     Address offset: 0x00 */
//   __IO uint32_t IER;       /*!< TSC interrupt enable register,                            Address offset: 0x04 */
//   __IO uint32_t ICR;       /*!< TSC interrupt clear register,                             Address offset: 0x08 */
//   __IO uint32_t ISR;       /*!< TSC interrupt status register,                            Address offset: 0x0C */
//   __IO uint32_t IOHCR;     /*!< TSC I/O hysteresis control register,                      Address offset: 0x10 */
//        uint32_t RESERVED1; /*!< Reserved,                                                 Address offset: 0x14 */
//   __IO uint32_t IOASCR;    /*!< TSC I/O analog switch control register,                   Address offset: 0x18 */
//        uint32_t RESERVED2; /*!< Reserved,                                                 Address offset: 0x1C */
//   __IO uint32_t IOSCR;     /*!< TSC I/O sampling control register,                        Address offset: 0x20 */
//        uint32_t RESERVED3; /*!< Reserved,                                                 Address offset: 0x24 */
//   __IO uint32_t IOCCR;     /*!< TSC I/O channel control register,                         Address offset: 0x28 */
//        uint32_t RESERVED4; /*!< Reserved,                                                 Address offset: 0x2C */
//   __IO uint32_t IOGCSR;    /*!< TSC I/O group control status register,                    Address offset: 0x30 */
//   __IO uint32_t IOGXCR[8]; /*!< TSC I/O group x counter register,                         Address offset: 0x34-50 */
// }TSC_TypeDef;

// /**
//   * @brief Universal Synchronous Asynchronous Receiver Transmitter
//   */

// typedef struct
// {
//   __IO uint32_t CR1;    /*!< USART Control register 1,                 Address offset: 0x00 */
//   __IO uint32_t CR2;    /*!< USART Control register 2,                 Address offset: 0x04 */
//   __IO uint32_t CR3;    /*!< USART Control register 3,                 Address offset: 0x08 */
//   __IO uint32_t BRR;    /*!< USART Baud rate register,                 Address offset: 0x0C */
//   __IO uint32_t GTPR;   /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
//   __IO uint32_t RTOR;   /*!< USART Receiver Time Out register,         Address offset: 0x14 */
//   __IO uint32_t RQR;    /*!< USART Request register,                   Address offset: 0x18 */
//   __IO uint32_t ISR;    /*!< USART Interrupt and status register,      Address offset: 0x1C */
//   __IO uint32_t ICR;    /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
//   __IO uint16_t RDR;    /*!< USART Receive Data register,              Address offset: 0x24 */
//   uint16_t  RESERVED1;  /*!< Reserved, 0x26                                                 */
//   __IO uint16_t TDR;    /*!< USART Transmit Data register,             Address offset: 0x28 */
//   uint16_t  RESERVED2;  /*!< Reserved, 0x2A                                                 */
// } USART_TypeDef;

// /**
//   * @brief Universal Serial Bus Full Speed Device
//   */

// typedef struct
// {
//   __IO uint16_t EP0R;            /*!< USB Endpoint 0 register,                Address offset: 0x00 */
//   __IO uint16_t RESERVED0;       /*!< Reserved */
//   __IO uint16_t EP1R;            /*!< USB Endpoint 1 register,                Address offset: 0x04 */
//   __IO uint16_t RESERVED1;       /*!< Reserved */
//   __IO uint16_t EP2R;            /*!< USB Endpoint 2 register,                Address offset: 0x08 */
//   __IO uint16_t RESERVED2;       /*!< Reserved */
//   __IO uint16_t EP3R;            /*!< USB Endpoint 3 register,                Address offset: 0x0C */
//   __IO uint16_t RESERVED3;       /*!< Reserved */
//   __IO uint16_t EP4R;            /*!< USB Endpoint 4 register,                Address offset: 0x10 */
//   __IO uint16_t RESERVED4;       /*!< Reserved */
//   __IO uint16_t EP5R;            /*!< USB Endpoint 5 register,                Address offset: 0x14 */
//   __IO uint16_t RESERVED5;       /*!< Reserved */
//   __IO uint16_t EP6R;            /*!< USB Endpoint 6 register,                Address offset: 0x18 */
//   __IO uint16_t RESERVED6;       /*!< Reserved */
//   __IO uint16_t EP7R;            /*!< USB Endpoint 7 register,                Address offset: 0x1C */
//   __IO uint16_t RESERVED7[17];   /*!< Reserved */
//   __IO uint16_t CNTR;            /*!< Control register,                       Address offset: 0x40 */
//   __IO uint16_t RESERVED8;       /*!< Reserved */
//   __IO uint16_t ISTR;            /*!< Interrupt status register,              Address offset: 0x44 */
//   __IO uint16_t RESERVED9;       /*!< Reserved */
//   __IO uint16_t FNR;             /*!< Frame number register,                  Address offset: 0x48 */
//   __IO uint16_t RESERVEDA;       /*!< Reserved */
//   __IO uint16_t DADDR;           /*!< Device address register,                Address offset: 0x4C */
//   __IO uint16_t RESERVEDB;       /*!< Reserved */
//   __IO uint16_t BTABLE;          /*!< Buffer Table address register,          Address offset: 0x50 */
//   __IO uint16_t RESERVEDC;       /*!< Reserved */
//   __IO uint16_t LPMCSR;          /*!< LPM Control and Status register,        Address offset: 0x54 */
//   __IO uint16_t RESERVEDD;       /*!< Reserved */
//   __IO uint16_t BCDR;            /*!< Battery Charging detector register,     Address offset: 0x58 */
//   __IO uint16_t RESERVEDE;       /*!< Reserved */
// } USB_TypeDef;

// /**
//   * @brief Window WATCHDOG
//   */
// typedef struct
// {
//   __IO uint32_t CR;   /*!< WWDG Control register,       Address offset: 0x00 */
//   __IO uint32_t CFR;  /*!< WWDG Configuration register, Address offset: 0x04 */
//   __IO uint32_t SR;   /*!< WWDG Status register,        Address offset: 0x08 */
// } WWDG_TypeDef;

/**
  * @}
  */

/** @addtogroup Peripheral_memory_map
  * @{
  */

#define FLASH_BASE            0x08000000UL              /*!< FLASH base address in the alias region */
#define FLASH_BANK1_END       0x0801FFFFUL /*!< FLASH END address of bank1 */
#define SRAM_BASE             0x20000000UL              /*!< SRAM base address in the alias region */
#define PERIPH_BASE           0x40000000UL              /*!< Peripheral base address in the alias region */

/*!< Peripheral memory map */
#define APBPERIPH_BASE        PERIPH_BASE
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000UL)

